/*
    Створіть свій власний репозиторій.
    В ньому створіть гілку js_homework1 (кожна наступна домашня робота буде здійснюватись в окремій гілці).
    Вам необхідно вказати, яким буде результат операції та описати крок за кроком у вигляді коментарів, як відбувається перетворення в кожному прикладі:
*/


1)  'number' + 3 + 3                    //number33          так як спочатку іде строка, то і трійки прирівняло до строки. Вийшла конкатинація строка поєдналась із 3 та ще з 3

2)  null + 3                            //3                 налл в мат. формулах перетворюється в 0. 0+3 = 3 математичне рівняння

3)  5 && "qwerty"                       //qwerty            5 - це тру. і строка не пуста теж тру. Тому із двох тру обрало фінальне.

4)  +'40' + +'2' + "hillel";            //42hillel          +'40' це якийсь унарний плюс. Тобто строку переводимо у число. виходить число 40, далі додавання, знову перевод 2 у число (40+2=42) далі конкатинація бо число до строки не додати 

5)  '10' - 5 === 6;                     //false             '10' - 5 переводить '10' у число, бо іде мат формула віднімання (- не працює, як +. немає другого значення) = 5, 5 === 6 це фолс. бо 5 не дорівнює 6

6)  true + false                        //1                 1 + 0 = 1, перевело тру та фолс у числові відображення

7)  '4px' - 3                           //nan               4рх - строка - 3. від строки не відняти число. тому нан. Не число.

8)  '4' - 3                             //1                 4 конвертувало у число бо за ним йшла операція віднімання числа = 1

9)  '6' + 3 ** 0;                       //61                6 строка, далі конкатенуємо з 3 у ступені 0, тобто 1.

10)  12 / '6'                           //2                 12 / 6 = 2 проста матиматика. Є мат. формула ділення, тому приводить до єдиного допустимого спільного. то можна перевести у строку, от і перевело.

11)  '10' + (5 === 6);                  //10false           5 не дорівнює 6 тому фолс. строка 10 + строка фолс

12)  null == ''                         //false             нал це незаповнене значення, а "" це порожня строка. Тому відсутність не дорівнює пустоті.

13)  3 ** (9 / 3);                      //27                9 / 3 = 3. 3 у кубі = 27

14)  !!'false' == !!'true'              //true              тут іде подвійне заперечення. Але так як заперечує строки, то строки лишаються строками. строка == строці

15)  0 || '0' && 1                      //1                 або іде до значення тру, а енд до значення фолс. Тут 0 - фолс, "0" - строка, тру або 1 - теж тру. Тому взяло 1 - тру.

16)  (+null == false) < 1;              //false             плюс перед налом приводить значення у число. +нал - нуль дорівнює фолс - теж нуль. Тобто цей шмат буде тру. Тру - 1. 1 не меньше 1. Тому фолс

17)  false && true || true              //true              так як анд іде до першого фолс то зліва буде фолс. значить ідемо на або, який іде до першого тру і обираємо тру.

18)  false && (false || true);          //false             тут спочатку дивимось фолс або тру. так як або завжди бере тру, то далі буде фолс і тру. А значення і обирає фолс, значить результат фолс.

19)  (+null == false) < 1 ** 5;         //false              як і раніше +null = 0. фолс = 0ю 0 = 0 значить тру. тру = 1. 1 у 5 ступені то 1. 1*1*1*1*1=1. 1 не меньше 1го. тому фолс