/*
Необхідно написати програму, яка буде виводити інформацію за умовами, при яких число виводитиметься з правильним словом: "рік", "роки" або "років" (тобто "29 років" чи "4 роки").

Умови виконання ДЗ:

    Рік отримувати через prompt()
    Зробити перевірку, що користувач ввів число, і це число не є відʼємним.
    Не використовувати функції або інші матеріали, які ми не вивчали.
    Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки.

Будь ласка, надайте наступні дані для перевірки вашої роботи:

    Посилання на вашу гілку js_homework2, в якій міститиметься файл з виконаним завданням.
*/

let age = prompt ("Вкажи свій вік числом");
if (age != +age){
    console.log(age+" не число");
}else if(+age < 0){
    console.log("вік не може бути від'ємним!");
}else if(+age == 0){
    console.log("ІДИ ЗВІДСИ, БРЕХЛО!");
}else if(+age >= 150){
    console.log("Вітаю тебе, довгожитель!")
}else if(+age%10 == 1 && +age%100 != 11){
    console.log(`Тобі ${age} рік!`);
}else if(+age%10>=2 && +age%10<=4 && !([12, 13, 14].includes(+age % 100))){
    console.log(`Тобі ${age} роки!`)
}else{
    console.log(`Тобі ${age} років!`)
}