/*
Напишіть програму яка буде приймати два значення, перше це одиниця вимірювання (кілометри, години та кілограми), друге значення це кількість, а потім переводити ці значення:

    кілометри - в метри
    години - в хвилини
    кілограми - в грами

Зробити вивід отриманої інформації у вигляді - "10 км це 10000 м" або "1 год це 60хв", або "1 кг це 1000 г". 

Умови виконання ДЗ:

    В задачі не обовʼязково викорисутовувати prompt, просто запишіть значення в зміні.
    Обовʼязково при написанні завдання використовуйте switch
    Продумати варінат, якщо буде введена якась інша одиниця виміру
    Мудрувати та створювати валідацію не потрібно

Для перевірки вашої роботи:

    Додайте ДЗ у гілку js_homework2
    Вишліть посилання на вашу гілку
*/

let odinica = "км";
let chislo = 15;

switch (odinica){
    case "км":
        var result = chislo * 1000;
        console.log(chislo+" "+odinica+" це "+result+" метрів");
        break;
    case "кг":
        var result = chislo * 1000;
        console.log(chislo+" "+odinica+" це "+result+"  грам");
        break;
    case "год":
        var result = chislo * 60;
        console.log(chislo+" "+odinica+" це "+result+"  хвилин");
        break;
    default:
        console.log("Покищо невідома одиниця виміру");
    
}