/*
Написати функцію pow(x,y) яка буде приймати 2 числа, перше - це число яке ми будемо зводити у ступінь, друге - у яку ступінь.

Наприклад pow(2,3) функція поверне значення 8, тобто два в кубі. 

Умови виконання ДЗ:

Не використовувати **
Не використовувати функції або інші матеріали, які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки
Для перевірки вашої роботи:

Створіть гілку js_homework3.
Додайте туди ваше домашне завдання (для кожної задачі окремий файл)
Вишліть посилання вашу гілку
*/

pow(3,3);

function pow (number,step){
    let i = 1;
    let res = number;
        if(step==0){
            console.log('1');
        }else if(step==1){
            console.log(number);
        }else{
            while(i!=step){
                res = res * number;
                console.log(res);
                i++;
        }
    }  
}