/*
Написати функцію pow(x,y) яка буде приймати 2 числа, перше - це число яке ми будемо зводити у ступінь, друге - у яку ступінь.

Наприклад pow(2,3) функція поверне значення 8, тобто два в кубі. 

Умови виконання ДЗ:

Не використовувати **
Не використовувати функції або інші матеріали, які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки
Для перевірки вашої роботи:

Створіть гілку js_homework3.
Додайте туди ваше домашне завдання (для кожної задачі окремий файл)
Вишліть посилання вашу гілку
*/

let number = pow(5,2);

function pow (number,degree){
    let result = number;
        if(degree==0){
            return (1);
        }else if(degree==1){
            return (number);
        }else{
            let i = 1;
            while(i<degree){
                result = result * number;
                i++;
        }
        return (result);
    }  
}

console.log (number);