/*
Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу): 
на першому рядку - одна зірочка, на другому - дві, і так далі. 
Рішення оформіть у вигляді функції, куди передаються два параметри: 
висота трикутника та символ, яким його потрібно "малювати".

Якось так:
// виклик функції
drawTriangle(5, '*');
// результат роботи функції в консолі

*
**
***
****
*****

Умови виконання ДЗ:
Домашню роботу необхідно зробити двома способами
В задачі не потрібно використовувати prompt() або щось інше повязане з UI
Не використовувати функції або інші матеріали, які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки
*/


drawTriangle (5, '/');
drawTriangle2 (5, '0');

function drawTriangle (size, simbol) {
    let i = 0;
    let j = simbol;
    for (let i = 0; i <= size; i++){
        console.log(j);
        j = j+simbol;
    }
}

function drawTriangle2 (size, simbol) {
    let i = 0;
    let j = simbol;
    while (i<=size){
        console.log(j);
        j = j+simbol;
        i++;
    }
}
